upstream/OpenFOAM-v2606/modules/adios/tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
# -----------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

# Create ignition cells cellSet
runApplication topoSet

runApplication decomposePar

runParallel $(getApplication)

#------------------------------------------------------------------------------
